In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn import linear_model

In [2]:
df = pd.read_csv("C:/Users/hp/hiring.csv")
df

  experience  test_score(out_of_10)  interview_score(out_of_10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
def word_to_number(word):
    if word=="one":
        return 1
    elif word=="two":
        return 2
    elif word=="three":
        return 3
    elif word=="four":
        return 4
    elif word=="five":
        return 5
    elif word=="six":
        return 6
    elif word=="seven":
        return 7
    elif word=="eight":
        return 8
    elif word=="nine":
        return 9
    elif word=="ten":
        return 10
    elif word=="eleven":
        return 11
    elif word=="twelve":
        return 12
    else:
        return None
    
word_to_number("two")

2

In [4]:
def word_to_numbers(words):
    return words.apply(word_to_number)

In [5]:
df["Experience"] = word_to_numbers(df.experience)

In [6]:
df

,experience,test_score(out_of_10),interview_score(out_of_10),salary($),Experience
0,NaN,8.0,9,50000,NaN
1,NaN,8.0,6,45000,NaN
2,five,6.0,7,60000,5.0
3,two,10.0,10,65000,2.0
4,seven,9.0,6,70000,7.0
5,three,7.0,10,62000,3.0
6,ten,NaN,7,72000,10.0
7,eleven,7.0,8,80000,11.0

In [7]:
df = df.drop(["experience"], axis="columns")
df

   test_score(out_of_10)  interview_score(out_of_10)  salary($)  Experience
0                    8.0                           9      50000         NaN
1                    8.0                           6      45000         NaN
2                    6.0                           7      60000         5.0
3                   10.0                          10      65000         2.0
4                    9.0                           6      70000         7.0
5                    7.0                          10      62000         3.0
6                    NaN                           7      72000        10.0
7                    7.0                           8      80000        11.0

In [10]:
import math
test_score_out_of_10_median = math.floor(df['test_score(out_of_10)'].median())
test_score_out_of_10_median

8

In [11]:
df['test_score(out_of_10)'] = df['test_score(out_of_10)'].fillna(test_score_out_of_10_median)
df['test_score(out_of_10)']

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: test_score(out_of_10), dtype: float64

In [12]:
Experience_median = math.floor(df.Experience.median())
Experience_median

6

In [13]:
df.Experience = df.Experience.fillna(Experience_median)
df.Experience

0     6.0
1     6.0
2     5.0
3     2.0
4     7.0
5     3.0
6    10.0
7    11.0
Name: Experience, dtype: float64

In [14]:
df.head()

   test_score(out_of_10)  interview_score(out_of_10)  salary($)  Experience
0                    8.0                           9      50000         6.0
1                    8.0                           6      45000         6.0
2                    6.0                           7      60000         5.0
3                   10.0                          10      65000         2.0
4                    9.0                           6      70000         7.0

In [16]:
df.isnull().sum()

test_score(out_of_10)         0
interview_score(out_of_10)    0
salary($)                     0
Experience                    0
dtype: int64

In [17]:
x = df.drop(["salary($)"], axis=1)
x

   test_score(out_of_10)  interview_score(out_of_10)  Experience
0                    8.0                           9         6.0
1                    8.0                           6         6.0
2                    6.0                           7         5.0
3                   10.0                          10         2.0
4                    9.0                           6         7.0
5                    7.0                          10         3.0
6                    8.0                           7        10.0
7                    7.0                           8        11.0

In [19]:
y = df['salary($)']
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [20]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [21]:
model.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [22]:
model.predict([[8,9,6]])

array([65756.09756098])